        IDENTIFICATION DIVISION.
        
        PROGRAM-ID. HELLOWORLD.
        
        ENVIRONMENT DIVISION.
        
        DATA DIVISION.
        
        PROCEDURE DIVISION.

         DISPLAY "HELLO WORLD".
         STOP RUN.
