000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. PROG06.
000030 AUTHOR. JOSE FRANCISCO RODRIGUEZ. GARCIA.
000040 DATE-WRITTEN. 22-07-2026.
000050*REFRESCANDO CONOCIMIENTOS DE COBOL74 UNISYS
000060 SECURITY. FOREVER.
000070 ENVIRONMENT DIVISION.
000080 DATA DIVISION.
000090 WORKING-STORAGE SECTION.
000100*
000110     01 WKS-NUM-A PIC 9(04).
000120     01 WKS-NUM-B PIC 9(04).
000130     01 WKS-NUM-C PIC 9(04).
000150
000160 PROCEDURE DIVISION.
000170 0000-CONTROL.
000180
000190     DISPLAY "ESCRIBE EL PRIMER NUMERO: "
000200     ACCEPT WKS-NUM-A
000210     DISPLAY "ESCRIBE EL SEGUNDO NUMERO: "
000220     ACCEPT WKS-NUM-B
000230     DISPLAY "ESCRIBE EL TERCER NUMERO: "
000240     ACCEPT WKS-NUM-C
000250     IF WKS-NUM-A < WKS-NUM-B AND 
000260        WKS-NUM-B < WKS-NUM-C
000260         DISPLAY WKS-NUM-A " , " WKS-NUM-B " , " WKS-NUM-C
000270     ELSE
000280         IF WKS-NUM-A < WKS-NUM-B AND 
000290             WKS-NUM-B > WKS-NUM-C
000300             DISPLAY WKS-NUM-A " , " WKS-NUM-C " , " WKS-NUM-B
000310     STOP RUN.
