000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. PROG04.
000030 AUTHOR. JOSE FRANCISCO RODRIGUEZ. GARCIA.
000040 DATE-WRITTEN. 22-07-2026.
000050*REFRESCANDO CONOCIMIENTOS DE COBOL74 UNISYS
000060 SECURITY. FOREVER.
000070 ENVIRONMENT DIVISION.
000080 DATA DIVISION.
000090 WORKING-STORAGE SECTION.
000100*
000110     01 WKS-A PIC 9(06)V9(06).
000120     01 WKS-B PIC 9(06)V9(06).
000130     01 WKS-C PIC 9(06)V9(06).
000140     01 WKS-D PIC S9(06)V9(06).
000150
000160 PROCEDURE DIVISION.
000170 0000-CONTROL.
000180
000190     MOVE 118   TO WKS-A
000200     MOVE 117   TO WKS-B
000210     MOVE 1     TO WKS-C
000220     COMPUTE WKS-D = WKS-B * WKS-A + WKS-C
000230     DISPLAY "D=117*118+1 CON COMPUTE ES: "
000240     DISPLAY WKS-D
000250     MULTIPLY WKS-B BY WKS-A
000260     ADD WKS-C TO WKS-B GIVING WKS-D
000270     DISPLAY "D=117*118+1 CON MULTIPLY Y ADD ES: "
000280     DISPLAY WKS-D
000290     STOP RUN.
