000010  IDENTIFICATION DIVISION.
000020  PROGRAM-ID. PROG01.
000030  AUTHOR. JOSE FRANCISCO RODRIGUEZ. GARCIA.
000040  DATE-WRITTEN. 22-07-2026.
000050*REFRESCANDO CONOCIMIENTOS DE COBOL74 UNISYS
000060  SECURITY. FOREVER.
000070  ENVIRONMENT DIVISION.
000080  DATA DIVISION.
000090  PROCEDURE DIVISION.
000100  0000-CONTROL.
000110      DISPLAY "HOLA UNISYS DE NUEVO".
000120      STOP RUN.
