000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. PROG05.
000030 AUTHOR. JOSE FRANCISCO RODRIGUEZ. GARCIA.
000040 DATE-WRITTEN. 22-07-2026.
000050*REFRESCANDO CONOCIMIENTOS DE COBOL74 UNISYS
000060 SECURITY. FOREVER.
000070 ENVIRONMENT DIVISION.
000080 DATA DIVISION.
000090 WORKING-STORAGE SECTION.
000100*
000110     01 WKS-EDAD PIC 9(02).
000120     01 WKS-NOMBRE PIC X(36).
000150
000160 PROCEDURE DIVISION.
000170 0000-CONTROL.
000180
000190     DISPLAY "ESCRIBE TU NOMBRE: "
000200     ACCEPT WKS-NOMBRE
000210     DISPLAY "ESCRIBE TU EDAD: "
000220     ACCEPT WKS-EDAD
000230     DISPLAY "TU NOMBRE ES: " WKS-NOMBRE
000240     DISPLAY "TU EDAD ES: " WKS-EDAD
000250     STOP RUN.
